[
	{
		"code": "GD204F",
		"name": "Graphic design, introduction",
		"start": "Spring-2020",
		"credits": "7,5 hp",
		"description": "Designing layouts, typography, logotype design.",
		"techniques_used": [
			"Adobe illustrator",
			"Adobe indesign"
		],
		"projects_id": [],
		"school": "Högskolan Kristianstad"
	},

	{
		"code": "D0015D",
		"name": "Web development, introduction",
		"start": "Spring-2021",
		"credits": "7,5 hp",
		"description": "Web design with user friendly focus following swedish laws. Basic to advanced HTML and CSS knowledge. Mobile responsive website.",
		"techniques_used": [
			"HTML",
			"CSS"
		],
		"projects_id": [{
			"id": 1,
			"name": "Website for group mindfullness trips."
		}],
		"school": "Luleå tekniska universitet"
	},
	{
		"code": "TDP001",
		"name": "Management of computer environment",
		"start": "Fall-2021",
		"credits": "4 hp",
		"description": "Manage computer environment, scripting, text editor, internet servers, version control, operative systems, ",
		"techniques_used": [
			"Git",
			"Latex",
			"Regex"
		],
		"projects_id": [
			{
				"id": 2,
				"name": "blogg"
			}
		],
		"school": "Linköpings universitet"
	},
	{
		"code": "TDP002",
		"name": "Imperative programming",
		"start": "Fall-2021",
		"credits": "6 hp",
		"description": "Imperative programming, input/output, conditional statements, loops, filemanagement, data structures, modules API, algorithms, testing.",
		"techniques_used": [
			"Python",
			"Git"
		],
		"projects_id": [],
		"school": "Linköpings universitet"
	},
	{
		"code": "TDP003",
		"name": "Project: Personal Computer Environment",
		"start": "Fall-2021",
		"credits": "6 hp",
		"description": "Basic ability to administer personal computer environment in practice. Ability to develop programs according to a specification for personal needs. Documents during development, planning, lo-fi prototype, project plan, system documentation",
		"techniques_used": [
			"Python",
			"HTML/CSS",
			"Flask/Jinja",
			"Json",
			"Git",
			"Latex"
		],
		"projects_id": [
			{
				"id": 3,
				"name": "Personal portfolio for future projects."
			}
		],
		"school": "Linköpings universitet"
	},
	{
		"code": "TDP004",
		"name": "Object Oriented Programming",
		"start": "Fall-2021",
		"credits": "8 hp",
		"description": "Concepts in object oriented programming and design. Object oriented programming and constructs in object oriented programming languages, e.g. class, object, encapsulation, inheritance. Constructs for repetition and choice. Input/Output. Data structures and algorithms using standard libraries: containrar, search, sorting, iterators. Datatypes, declarations, statements, expressions, functions. Dynamic memory management.",
		"techniques_used": [
			"C++",
			"Git"
		],
		"projects_id": [],
		"school": "Linköpings universitet"
	},
	{
		"code": "TDP005",
		"name": "Project: Object Oriented System",
		"start": "Fall-2021",
		"credits": "6 hp",
		"description": "Application of constructs in an object oriented language (C++) in a suitable way. Experience of using tools in program implementation. Code design. Experience of project phases: design, implementation, testing, documentation. ",
		"techniques_used": [
			"C++",
			"SFML",
			"Make",
			"Latex",
			"Git"
		],
		"projects_id": [
			{
				"id": 4,
				"name": "Game Save Santa. Capture falling objects and gather points!"
			}
		],
		"school": "Linköpings universitet"
	},
	{
		"code": "TDP007",
		"name": "Computer Language Construction",
		"start": "Spring-2022",
		"credits": "6 hp",
		"description": "Structure and implementation of programming langauges. Abstraction and the role of abstraction in programming languages. Basic principles of interpreter design. Regular expressions and finite automatons. Syntactic parsing. Abstract syntax trees. Overview of different types of computer languages.",
		"techniques_used": [
			"Ruby"
		],
		"projects_id": [
			
		],
		"school": "Linköpings universitet"
	},
	{
		"code": "TDTS04",
		"name": "Computer Networks and Distributed Systems",
		"start": "Spring-2022",
		"credits": "8 hp",
		"description": "Basics for distributed systems, scaling, architectures, rpc and port mapping, socket-based communication between processes. Pitfalls when implementing distributed systems. Object-based distributed systems and web-based distributed systems. Caching, replication, and fault tolerance. UTC, NTP. Lamport and vector clocks. Mutual exclusion. client-server. CDN and Akamai. Protocol layer concept. System architectures. Network types, their characteristics and components (router, switch, hub, repeater). Protocol mechanisms and channels. Access network techniques. MAC protocols. The collision domain concept. The sliding window protocol. Error detection. LAN. Wireless networks (Bluetooth, WiFi, WiMax). Internet and standardization. The TCP/IP protocol family. Distance vector and link-state routing. ICMP. ARP. NAT. DHCP. Naming, addressing and routing in the Internet. TCP's retransmission timer, flow control and congestion control. Reliable data delivery in TCP. Three-way handshake. Network performance issues. IP telephony. P2P networks. The DHT data structure. Internet history. Internet design principles. Lan background. Trends.",
		"techniques_used": [
			"Python socket"
		],
		"projects_id": [
			
		],
		"school": "Linköpings universitet"
	}
]