[
    {
        "name": "Webpage for company",
        "id": 1,
        "start_date": "2020-02-01",
        "end_date": "2021-05-31",
        "course_id": "D0015D",
        "course_name": "Web development, introduction",
        "project_type": "school",
        "techniques_used": [
            "HTML",
            "CSS"
        ],
        "description": "Booking site for fictional Harmony Travel AB",
        "long_description": "With a strong focus on user-friendliness so that everyone can use a website. Both disability and on different sizes of devices. During a course in web development.",
        "image": "harmony.PNG",
        "external_link": "",
        "co_programmer": "None"
    },
    
    {
        "name": "Portfolio",
        "id": 3,
        "start_date": "2021-08-30",
        "end_date": "2021-10-21",
        "course_id": "TDP003",
        "course_name": "Project: Personal Computer Environment",
        "project_type": "school",
        "techniques_used": [
            "HTML",
            "CSS",
            "Python",
            "Flask",
            "Jinja",
            "Json",
            "Git"
        ],
        "description": "List, sort and search through listed projects.",
        "long_description": "Focus on data storage and being able to sort, filter and handle error codes. Documents such as LoFi prototype, project plan, system documentation and test documentation were made. Learned using backend with frontend by using flask and jinja.",
        "image": "portfolio.png",
        "external_link": "",
        "co_programmer": "Julia Skantz"
    },
    {
        "name": "Game - Save Santa",
        "id": 4,
        "start_date": "2021-11-17",
        "end_date": "2021-12-17",
        "course_id": "TDP005",
        "course_name": "Project: Object Oriented System",
        "project_type": "school",
        "techniques_used": [
            "C++",
            "SFML",
            "Make",
            "Git"
        ],
        "description": "Capture falling objects and gather points!",
        "long_description": "Save Santa is a challenging and fun game that can be played multiple times where you compete to collect points and persevere for as long as possible. The game is a 2D arcade game where you can control the plot to the right and left by using the arrow keys. with the help of the elf you will catch and miss different falling objects from the sky to survive and collect more points.The game is over when the elf loses all his life.The four different falling objects heart, star, bomb and caramel have different properties. heart gives you +1 life and +5 points, a star gives you +10 points, but beware of the bombs, because if you happen to catch one you lose -1 life.The caramel is very unusual and fast, but if you manage to catch it is worth +30 points. It is also not okay to miss all objects. If you miss a star you lose -1 life. The difficulty increases with how long you play the game. After this project I have mastered the skills of doing games in SFML using C ++. The game is made with an abstraction of classes and inheritance hierarchy. I have worked with my project partner Julia Skantz on the project and with good time planning and efficient work during the day, we finished the game a full week before the deadline. The project has developed my skills in Git, mainly to handle various Git conflicts and merges. The game shows my knowledge of C ++ which can be applied to other projects with this programming language.",
        "image": "savesanta.png",
        "external_link": "",
        "co_programmer": "Julia Skantz"
    },
    {
        "name": "This portfolio",
        "id": 5,
        "start_date": "2022-01-12",
        "end_date": "??",
        "course_id": "",
        "course_name": "",
        "project_type": "personal",
        "techniques_used": [
            "HTML",
            "CSS",
            "Python",
            "Json",
            "Flask",
            "Jinja",
            "Git"
        ],
        "description": "To display my projects",
        "long_description": "Portfolio quickly created in a month's time. By using my knowledge of HTML, CSS and Python create a general portfolio where it can easily be added or removed projects and completed courses in data warehousing.",
        "image": "this_portfolio.png",
        "external_link": "",
        "co_programmer": "None"
    },

    {
        "name": "Workout web app",
        "id": 6,
        "start_date": "2021-08-10",
        "end_date": "??",
        "course_id": "",
        "course_name": "",
        "project_type": "personal",
        "techniques_used": [
            "HTML",
            "CSS",
            "Python",
            "Json",
            "Flask",
            "Jinja",
            "Git"
        ],
        "description": "Login, save your workout and work out!",
        "long_description": "Web app created so that my boyfriend could easily track his strength training. By using flask and jinja handling login, adding accounts, and saving workouts. Web app is not finished.",
        "image": "training.png",
        "external_link": "",
        "co_programmer": "None"
    }
]